000100  IDENTIFICATION DIVISION. 
000200  PROGRAM-ID. HIWORLD.     
000300  PROCEDURE DIVISION.      
000400  MAIN-PARA.               
000500      DISPLAY 'HELLO WORLD FROM DILLONDEPEEL'
000600      STOP RUN.
